<?php
/**
 * Errors
 */
$messages['rus'][102] = 'Не найден узел документа %s';
$messages['rus'][103] = 'Некорректное значение узла документа %s';
$messages['rus'][104] = 'Не найден атрибут %s';

/**
 * Ошибка авторизации
 */
$messages['rus'][1000] = 'Ошибка авторизации.';

/**
 * Warnings
 */
$messages['rus'][1001] = 'Партнеру %s бронирование заявок запрещено.';

$messages['rus'][1100] = 'Страны не найдены';
$messages['rus'][1101] = 'Города отправления не найдены';
$messages['rus'][1102] = 'Города не найдены';
$messages['rus'][1103] = 'Группы категорий не найдены';
$messages['rus'][1104] = 'Группы питаний не найдены';
$messages['rus'][1105] = 'Отели не найдены';
$messages['rus'][1106] = 'Даты начала туров не найдены';
$messages['rus'][1107] = 'Цены не найдены';
$messages['rus'][1108] = 'Предложение больше не действительно';
$messages['rus'][1109] = 'Страны не найдены';
$messages['rus'][1110] = 'Рейсы не найдены';
$messages['rus'][1111] = 'Заявки не найдены';
$messages['rus'][1112] = 'Не удалось рассчитать стоимость заявки';
$messages['rus'][1113] = 'Неизвестная ошибка при сохранении заявки. Обратитесь к туроператору.';

$messages['rus'][1114] = 'Отмена заявки запрещена. Обратитесь к туроператору.';
$messages['rus'][1115] = 'Отмена заявки запрещена. До начала тура осталось меньше %s дней. Обратитесь к туроператору.';
$messages['rus'][1116] = 'Заявка %s уже отменена.';
$messages['rus'][1117] = 'Вы уже послали запрос на отмену этой заявки %s';

$messages['rus'][1118] = 'Обнаружена остановка продаж в отеле %s';

$messages['rus'][1119] = 'Валюты не найдены';

$messages['rus'][1120] = 'Заявка не найдена';

$messages['rus'][1121] = 'Обработаны не все данные. Уточните параметры поиска';

$messages['rus'][1122] = '%s'; //не удалось внести изменения в заявку
$messages['rus'][1123] = 'Неверно заполнена информация о туристе %s: %s.';
$messages['rus'][1124] = 'Бронирование регулярных рейсов доступно только на сайте туроператора.';


$messages['rus'][1200] = 'Ошибка конфигурации тура. Параметр не найден.';
$messages['rus'][1201] = 'Ошибка конфигурации тура. Параметр %s имеет некорректное значение.';
$messages['rus'][1202] = 'Нет возможности подселить туриста. По данному туру услуга подселения туриста не предоставляется туроператором.';

$messages['rus'][1204] = 'Услуга "%s" обязательна для бронирования.';
$messages['rus'][1205] = 'Тип услуги "%s" обязателен для бронирования.';
$messages['rus'][1206] = 'Не указан пользователь для uri %s.';
$messages['rus'][1207] = 'Должна быть указана конкретная виза. Визу "-----" забронировать нельзя.';

$messages['rus'][1298] = 'Оператор не поддерживает версию';
$messages['rus'][1299] = 'Оператор не поддерживает функцию';

$messages['rus'][1300] = 'Неправильная привязка туриста к услугам';
$messages['rus'][1301] = 'Некорректное направление рейса';
$messages['rus'][1302] = 'Неизвестный тип услуги';

$messages['rus'][1304] = 'Невозможно забронировать отель (%s).';
$messages['rus'][1305] = 'Невозможно забронировать транспорт (%s).';
$messages['rus'][1306] = 'Невозможно забронировать дополнительную услугу (%s).';
$messages['rus'][1307] = 'Невозможно забронировать страховку (%s).';
$messages['rus'][1308] = 'Невозможно забронировать визу (%s).';

$messages['rus'][1309] = 'Неправильное количество туристов';

$messages['rus'][1400] = 'Бронирование остановлено по причине: %s';
$messages['rus'][1401] = 'Предложение не действительно: %s';

/**
 * Infos
 */
$messages['rus'][2000] = 'Цена устарела.'.PHP_EOL.'Новая цена составляет %s %s.';
$messages['rus'][2001] = 'Вы послали запрос на отмену заявки %s.'.PHP_EOL.'Запрос не является подтверждением отмены.';
$messages['rus'][2999] = 'Происходит обновление веб-сервиса. Просим повторить запрос позже.';

/**
 * Question (Ok, Cancel)
 */
$messages['rus'][3000] = 'Расчетная стоимость заявки составляет %s %s.'.PHP_EOL.'Окончательная стоимость заявки может быть изменена туроператором после бронирования.'.PHP_EOL.'Забронировать заявку?';
$messages['rus'][3500] = 'Документ не готов.'.PHP_EOL.'Повторить запрос?';

/**
 * Question (Да, Нет, Cancel)
 */

/**
 * Question (Да, Нет)
 */
